ymaps.ready(init);

function init() {
    // Создаем карту.
    var myMap = new ymaps.Map("map", {
            center: [47.98, 37.64],
            zoom: 12
        }, {
            searchControlProvider: 'yandex#search'
        });

    // Создаем ломаную, используя класс GeoObject.
    var myGeoObject = new ymaps.GeoObject({
            // Описываем геометрию геообъекта.
            geometry: {
                // Тип геометрии - "Ломаная линия".
                type: "LineString",
                // Указываем координаты вершин ломаной.
                coordinates: [
                    [47.9822881, 37.6484966],
                    [47.9939959, 37.8041489]
                ]
            },
            // Описываем свойства геообъекта.
            properties:{
                // Содержимое хинта.
                hintContent: "Я геообъект",
                // Содержимое балуна.
                balloonContent: "Меня можно перетащить"
            }
        }, {
            // Задаем опции геообъекта.
            // Включаем возможность перетаскивания ломаной.
            draggable: true,
            // Цвет линии.
            strokeColor: "#FFFF00",
            // Ширина линии.
            strokeWidth: 5
        });

    // Создаем ломаную с помощью вспомогательного класса Polyline.
    var myPolyline = new ymaps.Polyline([
            // Указываем координаты вершин ломаной.
            [47.982438, 37.648294],
            [47.983316, 37.649351],
            [47.984445, 37.650593],
            [47.984548, 37.650621],
            [47.984532, 37.650772],
            [47.984899, 37.650972],
            [47.984825, 37.651660],
            [47.985921, 37.651983],
            [47.985875, 37.652559],
            [47.985908, 37.652583],
            [47.990682, 37.798477],
            [47.991002, 37.798457],
            [47.991208, 37.800817],
            [47.991199, 37.802004],
            [47.992091, 37.802004],
            [47.992468, 37.802765],
            [47.992727, 37.802756],
            [47.992749, 37.804364],
            [47.994085, 37.804410]
        ], {
            // Описываем свойства геообъекта.
            // Содержимое балуна.
            balloonContent: "Ломаная линия"
        }, {
            // Задаем опции геообъекта.
            // Отключаем кнопку закрытия балуна.
            balloonCloseButton: false,
            // Цвет линии.
            strokeColor: "#000000",
            // Ширина линии.
            strokeWidth: 4,
            // Коэффициент прозрачности.
            strokeOpacity: 0.5
        });

    // Добавляем линии на карту.
    myMap.geoObjects
        .add(myGeoObject)
        .add(myPolyline);
}
